# Challenge 9: Solutions
## Part II: Baseball Data

*Introductory - Intermediate level SQL*

------------

In [1]:
from sqlalchemy import create_engine
import pandas as pd
cnx = create_engine('postgresql://username:pswd@public_ip:port/database')

## Q1. What was the total spent on salaries by each team, each year?

In [2]:
pd.read_sql_query(r"""SELECT teamid as team, yearid as year, SUM(Salary) as total_salary 
                      FROM salaries 
                      GROUP BY team, year 
                      ORDER BY total_salary DESC
                      LIMIT 5;""", cnx)

  team  year  total_salary
0  NYA  2013   231978886.0
1  LAN  2013   223362196.0
2  LAN  2014   217014600.0
3  LAN  2015   215792000.0
4  NYA  2015   212751957.0

## Q2. What is the first and last year played for each player?

*Hint:* Create a new table from 'Fielding.csv'.

```sql
CREATE TABLE fielding(
      playerid VARCHAR(255),
      yearid INT,
      stint INT,
      teamID VARCHAR(255),
      lgID VARCHAR(255),
      pos VARCHAR(255), 
      G INT, 
      GS INT, 
      InnOuts INT, 
      PO INT, 
      A INT, 
      E INT, 
      DP INT, 
      PB INT, 
      WP INT, 
      SB INT, 
      CS INT, 
      ZR INT);
      
COPY fielding FROM '/home/ubuntu/baseball/Fielding.csv' DELIMITER ',' CSV HEADER;
```

In [3]:
pd.read_sql_query(r"""SELECT playerid, MIN(yearid) as min_year, MAX(yearid) as max_year
                      FROM fielding 
                      GROUP BY playerid
                      LIMIT 5;""", cnx)

    playerid  min_year  max_year
0  aardsda01      2004      2015
1  aaronha01      1954      1976
2  aaronto01      1962      1971
3   aasedo01      1977      1990
4   abadan01      2001      2003

## Q3. Who has played the most all star games?

In [4]:
pd.read_sql_query(r"""SELECT playerid, COUNT(*) as num_games 
                      FROM allstarfull
                      GROUP BY playerid 
                      ORDER BY num_games DESC
                      LIMIT 1;""", cnx)

    playerid  num_games
0  aaronha01         25

## Q4. Which school has generated the most distinct players? 

*Hint:* Create new table from 'CollegePlaying.csv'.

```sql
CREATE TABLE collegeplaying (
      playerid VARCHAR(255),
      schoolid VARCHAR(255),
      yearid INT);
      
COPY collegeplaying FROM '/home/ubuntu/baseball/CollegePlaying.csv' DELIMITER ',' CSV HEADER;
```

In [5]:
pd.read_sql_query(r"""SELECT schoolid, COUNT(DISTINCT(playerid)) as num_players
                      FROM collegeplaying
                      GROUP BY schoolid 
                      ORDER BY num_players DESC
                      LIMIT 5;""", cnx)

    schoolid  num_players
0      texas          107
1        usc          105
2  arizonast          101
3   stanford           86
4   michigan           76

## Q5. Which players have the longest career? Assume that the `debut` and `finalGame` columns comprise the start and end, respectively, of a player's career. 

*Hint:* Create a new table from 'Master.csv'. Also note that strings can be converted to dates using the [`DATE`](https://wiki.postgresql.org/wiki/Working_with_Dates_and_Times_in_PostgreSQL#WORKING_with_DATETIME.2C_DATE.2C_and_INTERVAL_VALUES) function and can then be used for date-based computations.

```sql
CREATE TABLE master (
             playerID VARCHAR(255),
             birthYear INT,
             birthMonth INT,
             birthDay INT,
             birthCountry VARCHAR(255),
             birthState VARCHAR(255),
             birthCity VARCHAR(255),
             deathYear INT,
             deathMonth INT,
             deathDay INT,
             deathCountry VARCHAR(255),
             deathState VARCHAR(255),
             deathCity VARCHAR(255),
             nameFirst VARCHAR(255),
             nameLast VARCHAR(255),
             nameGiven VARCHAR(255),
             weight INT,
             height INT,
             bats VARCHAR(255),
             throws VARCHAR(255),
             debut VARCHAR(255),
             finalGame VARCHAR(255),
             retroID VARCHAR(255),
             bbrefID VARCHAR(255));

COPY master FROM '/home/ubuntu/baseball/Master.csv' DELIMITER ',' CSV HEADER;

```

In [6]:
pd.read_sql_query(r"""SELECT playerid, debut, finalgame, DATE(finalgame) - DATE(debut) AS career_days
                      FROM master
                      ORDER BY career_days DESC NULLS LAST
                      LIMIT 5;""", cnx)

    playerid       debut   finalgame  career_days
0  altroni01  1898-07-14  1933-10-01        12862
1  orourji01  1872-04-26  1904-09-22        11836
2  minosmi01  1949-04-19  1980-10-05        11492
3  olearch01  1904-04-14  1934-09-30        11126
4  lathaar01  1880-07-05  1909-09-30        10678

In [7]:
# Alternative is to do the sort in pandas
(pd.read_sql_query(r"""SELECT playerid, debut, finalgame, DATE(finalgame) - DATE(debut) AS career_days
                       FROM master;""", cnx)
 .sort_values('career_days', ascending=False)
 .head())

        playerid       debut   finalgame  career_days
261    altroni01  1898-07-14  1933-10-01      12862.0
12736  orourji01  1872-04-26  1904-09-22      11836.0
11631  minosmi01  1949-04-19  1980-10-05      11492.0
12635  olearch01  1904-04-14  1934-09-30      11126.0
9549   lathaar01  1880-07-05  1909-09-30      10678.0

## Q6. What is the distribution of debut months?

*Hint:* look at the `DATE` and [`EXTRACT`](https://www.postgresql.org/docs/current/static/functions-datetime.html#FUNCTIONS-DATETIME-EXTRACT) functions.

In [8]:
pd.read_sql_query(r"""WITH _table AS (
                           SELECT EXTRACT(MONTH FROM DATE(debut)) AS debut_month
                           FROM master 
                      )
                      SELECT debut_month, COUNT(debut_month) AS counts
                      FROM _table
                      GROUP BY debut_month
                      ORDER BY counts DESC;""", cnx)

   debut_month  counts
0          9.0    5156
1          4.0    4810
2          5.0    2303
3          7.0    2032
4          8.0    2011
5          6.0    1983
6         10.0     309
7          3.0      49
8          NaN       0

## Q7. What is the effect of table join order on mean salary for the players listed in the main (master) table? 

*Hint:* Perform two different queries, one that joins on playerID in the salary table and other that joins on the same column in the master table. You will have to use left joins for each since right joins are not currently supported with SQLalchemy.

In [9]:
# Master table is the leftmost table
pd.read_sql_query(r"""SELECT AVG(salary) AS mean_salary
                      FROM master as m
                      LEFT JOIN salaries as s
                      ON m.playerid = s.playerid;""", cnx)

    mean_salary
0  2.007503e+06

In [10]:
# Salaries table is the leftmost table
pd.read_sql_query(r"""SELECT AVG(salary) AS mean_salary
                      FROM salaries as s
                      LEFT JOIN master as m
                      ON s.playerid = m.playerid;""", cnx)

    mean_salary
0  2.008563e+06